In [1]:
#%run "../app/dreams"
from sys import path
path.insert(0,'../app')
from dreams import dreams_mastersheet


import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns
from datetime import datetime

from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

In [2]:
df = dreams_mastersheet

In [3]:
date_du_jour = datetime.today().strftime("%d_%m_%Y")

# La cohort des beneficaires

In [4]:
base = df[
    (df.age_range!="not_valid_age")
    &(df.age_range!="25-29")
    &(df.timeOn_system=="required_Time_on")
]
base.code.count()
base_table = base.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
base_table

19729

fiscal_year  FY21Q1  FY21Q2  FY21Q3  FY21Q4  Q3fy20-Q4fy20  Grand Total
age_range
10-14           927     813     740     389           5081         7950
15-19          1015     715     457     276           5315         7778
20-24           522     344     203     115           2817         4001
Grand Total    2464    1872    1400     780          13213        19729

In [5]:
base18plus = df[
    (df.newage_range!="not_valid_age")
    &(df.newage_range!="25-29")
    &(df.newage_range!="10-17")
    &(df.timeOn_system=="required_Time_on")
]
base18plus.code.count()
base18plus_table = base18plus.pivot_table(index="newage_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
base18plus_table

6588

fiscal_year   FY21Q1  FY21Q2  FY21Q3  FY21Q4  Q3fy20-Q4fy20  Grand Total
newage_range
18-19            346     241     145      76           1779         2587
20-24            522     344     203     115           2817         4001
Grand Total      868     585     348     191           4596         6588

# curriculum

In [6]:
curriculum_complet = base[
    (base.dreams_curriculum=="curriculum_completed")
]
curriculum_complet.code.count()

curriculum_table = curriculum_complet.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
curriculum_table

16557

fiscal_year  FY21Q1  FY21Q2  FY21Q3  FY21Q4  Q3fy20-Q4fy20  Grand Total
age_range
10-14           741     623     626     286           4352         6628
15-19           820     537     388     238           4547         6530
20-24           413     275     154      94           2463         3399
Grand Total    1974    1435    1168     618          11362        16557

In [7]:
curriculum_inc = base[
    (base.dreams_curriculum=="curriculum_inc")
]
curriculum_inc.code.count()

curriculum_inc_table = curriculum_inc.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
curriculum_inc_table

3172

fiscal_year  FY21Q1  FY21Q2  FY21Q3  FY21Q4  Q3fy20-Q4fy20  Grand Total
age_range
10-14           186     190     114     103            729         1322
15-19           195     178      69      38            768         1248
20-24           109      69      49      21            354          602
Grand Total     490     437     232     162           1851         3172

# Condoms

In [8]:
condoms = base[
    (base.condoms=="tested_on_given_date")
]

condoms.code.count()

new_condoms = base[
    (base.new_condoms=="sensOuRecu")
]

new_condoms.code.count()

3399

3791

In [9]:
condoms.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)

fiscal_year  FY21Q1  FY21Q2  FY21Q3  FY21Q4  Q3fy20-Q4fy20  Grand Total
age_range
10-14            81      99      45      29            221          475
15-19           310     174     136      96            990         1706
20-24           241      94      61      42            780         1218
Grand Total     632     367     242     167           1991         3399

In [10]:
condoms_table = new_condoms.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
condoms_table

fiscal_year  FY21Q1  FY21Q2  FY21Q3  FY21Q4  Q3fy20-Q4fy20  Grand Total
age_range
10-14            84     104      95      65            260          608
15-19           341     219     168     110           1055         1893
20-24           259     123      68      43            797         1290
Grand Total     684     446     331     218           2112         3791

# depistage VIH

In [11]:
vih = base[
    (base.hts=="tested_on_given_date")
]
vih.code.count()

2051

In [12]:
depistage_table = vih.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
depistage_table

fiscal_year  FY21Q1  FY21Q2  FY21Q3  FY21Q4  Q3fy20-Q4fy20  Grand Total
age_range
10-14            34      10      20       5            384          453
15-19            95      26      27       9            665          822
20-24           156      27      32      10            551          776
Grand Total     285      63      79      24           1600         2051

# Post Care Treatment

In [13]:
post_violence_care = base[
    (base.post_care_treatment=="service_gyneco_vbg")
]
post_violence_care.code.count()

98

In [14]:
pvc_table = post_violence_care.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
pvc_table

fiscal_year  FY21Q1  FY21Q2  FY21Q4  Q3fy20-Q4fy20  Grand Total
age_range
10-14             3       0       0             16           19
15-19             3       1       1             37           42
20-24             0       1       0             36           37
Grand Total       6       2       1             89           98

# socio economique Approche

In [15]:
combin_socio_eco =  base[
    (base.socio_eco_app=="service_muso_gardening")
]

combin_socio_eco.code.count()

530

In [16]:
cse_table= combin_socio_eco.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
cse_table

fiscal_year  FY21Q1  FY21Q3  FY21Q4  Q3fy20-Q4fy20  Grand Total
age_range
10-14             1       0       1            152          154
15-19             4       1       0            172          177
20-24             1       0       0            198          199
Grand Total       6       1       1            522          530

# PREP

In [17]:
prep_sens = base[
    (base.sens_prep=="tested_on_given_date")
]
prep_sens.code.count()

prep_sens_table = prep_sens.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
prep_sens_table

593

fiscal_year  FY21Q1  FY21Q2  FY21Q3  FY21Q4  Q3fy20-Q4fy20  Grand Total
age_range
10-14             2       1       6       4             14           27
15-19            51      17      42       6             97          213
20-24           118      18      37       7            173          353
Grand Total     171      36      85      17            284          593

In [18]:
prep_accept = base[
    (base.acc_prep=="accept")
]
prep_accept.code.count()
prep_accept_table = prep_accept.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
prep_accept_table

52

fiscal_year  FY21Q1  FY21Q2  FY21Q3  FY21Q4  Q3fy20-Q4fy20  Grand Total
age_range
10-14             0       0       0       0              4            4
15-19             6       0       1       2             14           23
20-24             8       3       1       0             13           25
Grand Total      14       3       2       2             31           52

In [19]:
prep_ref = base[
    (base.ref_prep=="tested_on_given_date")
]
prep_ref.code.count()
prep_ref_table = prep_ref.pivot_table(
                        index="age_range",
                        columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
prep_ref_table

50

fiscal_year  FY21Q1  FY21Q2  FY21Q3  FY21Q4  Q3fy20-Q4fy20  Grand Total
age_range
10-14             0       0       0       0              4            4
15-19             6       0       1       1             13           21
20-24             8       3       1       0             13           25
Grand Total      14       3       2       1             30           50

In [20]:

prep = base[
    (base.init_prep=="tested_on_given_date")
]
prep.code.count()

prep_table = prep.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
prep_table

47

fiscal_year  FY21Q1  FY21Q2  FY21Q3  FY21Q4  Q3fy20-Q4fy20  Grand Total
age_range
10-14             0       0       0       0              4            4
15-19             6       0       1       1             12           20
20-24             8       3       1       0             11           23
Grand Total      14       3       2       1             27           47

In [21]:

prep_accept[prep_accept.code.isin(prep_ref.code)].code.count()
prep_accept[~prep_accept.code.isin(prep_ref.code)].code.count()

accepter_non_referer = prep_accept[~prep_accept.code.isin(prep_ref.code)]

46

6

In [22]:
prep_ref[prep_ref.code.isin(prep_accept.code)].code.count()
prep_ref[~prep_ref.code.isin(prep_accept.code)].code.count()


ref_non_accept = prep_ref[~prep_ref.code.isin(prep_accept.code)]

46

4

In [23]:
prep_ref[prep_ref.code.isin(prep.code)].code.count()
prep_ref[~prep_ref.code.isin(prep.code)].code.count()

46

4

In [24]:
prep[prep.code.isin(prep_ref.code)].code.count()
prep[~prep.code.isin(prep_ref.code)].code.count()

46

1

In [25]:

search_missing_prep = pd.ExcelWriter(f"find_missing_prep.xlsx",engine="xlsxwriter")

accepter_non_referer.to_excel(search_missing_prep,sheet_name="accepter_non_referer",index=True,na_rep="NULL")
ref_non_accept.to_excel(search_missing_prep,sheet_name="ref_non_accept",index=True,na_rep="NULL")
search_missing_prep.save()

NameError: name 'pd' is not defined

# jardinage

In [ ]:


garden = base[
    (base.is_gardening=="yes")
]
garden.code.count()

garden_table = garden.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
garden_table

478

fiscal_year  FY21Q1  FY21Q3  FY21Q4  Q3fy20-Q4fy20  Grand Total
age_range
10-14             1       0       1            147          149
15-19             4       1       0            159          164
20-24             1       0       0            164          165
Grand Total       6       1       1            470          478

# MUSO

In [ ]:
muso = base[
    (base.is_muso=="yes")
]
muso.code.count()

muso_table = muso.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
muso_table

65

fiscal_year  Q3fy20-Q4fy20  Grand Total
age_range
10-14                    5            5
15-19                   16           16
20-24                   44           44
Grand Total             65           65

# Primary Services

In [ ]:
ps14 = base[
    (base.ps_10_14=="curriculum-servis")
]
ps14.code.count()

ps19 = base[
    (base.ps_15_19=="condoms&curriculum")
]
ps19.code.count()

ps24 = base[
    (base.ps_20_24=="condoms&curriculum")
]
ps24.code.count()

6613

1661

1140

In [ ]:
ps14_table = ps14.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
ps14_table

fiscal_year  FY21Q1  FY21Q2  FY21Q3  FY21Q4  Q3fy20-Q4fy20  Grand Total
age_range
10-14           743     626     618     274           4352         6613
Grand Total     743     626     618     274           4352         6613

In [ ]:

ps19_table= ps19.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
ps19_table

fiscal_year  FY21Q1  FY21Q2  FY21Q3  FY21Q4  Q3fy20-Q4fy20  Grand Total
age_range
15-19           305     172     155      82            947         1661
Grand Total     305     172     155      82            947         1661

In [ ]:
ps24_table = ps24.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
ps24_table

fiscal_year  FY21Q1  FY21Q2  FY21Q3  FY21Q4  Q3fy20-Q4fy20  Grand Total
age_range
20-24           230      99      51      31            729         1140
Grand Total     230      99      51      31            729         1140

# reporting

In [ ]:
table_report = pd.ExcelWriter(f"DREAMS_services_Quarter_enroled_{date_du_jour}.xlsx",engine="xlsxwriter")
ps14_table.to_excel(table_report,sheet_name="ps14_table",index=True,na_rep="NULL")
ps19_table.to_excel(table_report,sheet_name="ps19_table",index=True,na_rep="NULL")
ps24_table.to_excel(table_report,sheet_name="ps24_table",index=True,na_rep="NULL")
prep_table.to_excel(table_report,sheet_name="prep_table",index=True,na_rep="NULL")
prep_sens_table.to_excel(table_report,sheet_name="prep_sens_table",index=True,na_rep="NULL")
prep_sens_table.to_excel(table_report,sheet_name="prep_sens_table",index=True,na_rep="NULL")
prep_sens_table.to_excel(table_report,sheet_name="prep_sens_table",index=True,na_rep="NULL")
cse_table.to_excel(table_report,sheet_name="cse_table",index=True,na_rep="NULL")
pvc_table.to_excel(table_report,sheet_name="pvc_table",index=True,na_rep="NULL")
depistage_table.to_excel(table_report,sheet_name="depistage_table",index=True,na_rep="NULL")
condoms_table.to_excel(table_report,sheet_name="condoms_table",index=True,na_rep="NULL")
depistage_table.to_excel(table_report,sheet_name="depistage_table",index=True,na_rep="NULL")
curriculum_table.to_excel(table_report,sheet_name="curriculum_table",index=True,na_rep="NULL")
base_table.to_excel(table_report,sheet_name="base_table",index=True,na_rep="NULL")
table_report.save()